In [1]:
import pandas as pd

In [2]:
dict1 = {
    "name":['az','by','cx','dw','ep','fq','gr','hs'],
    "marks":[10,20,30,40,50,60,70,80],
    "city":['aaa','bbb','ccc','ddd','eee','fff','ggg','hhh']
}

In [3]:
df = pd.DataFrame(dict1)
df

  name  marks city
0   az     10  aaa
1   by     20  bbb
2   cx     30  ccc
3   dw     40  ddd
4   ep     50  eee
5   fq     60  fff
6   gr     70  ggg
7   hs     80  hhh

In [4]:
df.shape

(8, 3)

In [5]:
df.head()

  name  marks city
0   az     10  aaa
1   by     20  bbb
2   cx     30  ccc
3   dw     40  ddd
4   ep     50  eee

In [6]:
df.tail()

  name  marks city
3   dw     40  ddd
4   ep     50  eee
5   fq     60  fff
6   gr     70  ggg
7   hs     80  hhh

In [7]:
df.describe()

           marks
count   8.000000
mean   45.000000
std    24.494897
min    10.000000
25%    27.500000
50%    45.000000
75%    62.500000
max    80.000000

In [8]:
df['marks']

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
Name: marks, dtype: int64

In [9]:
df.columns

Index(['name', 'marks', 'city'], dtype='object')

In [10]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [11]:
df[['name','marks']].head()

  name  marks
0   az     10
1   by     20
2   cx     30
3   dw     40
4   ep     50

In [12]:
df[df.marks>50]

  name  marks city
5   fq     60  fff
6   gr     70  ggg
7   hs     80  hhh